docs/1c-export-2026-06-02/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/СтатусыМаршрутногоЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СтатусыМаршрутногоЛиста</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Составляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/СпособыСписанияОстаткаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СпособыСписанияОстаткаТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРезерва</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/ВидыОперацийЗакрытиеЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗакрытиеЗаказовПокупателей</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеЗаказов</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеРезервов</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьНулевыеЗначения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексСтрокиТаблицыЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

docs/1c-export-2026-06-02/Documents/ЗакрытиеЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЗакрытиеЗаказовПокупателей</Name>
			<Comment>(Общ) Закрытие заказов покупателей без исполнения</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказовПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>InformationRegister.ПричиныЗакрытияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗакрытиеЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗакрытияЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗакрытияЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>(Общ) Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>(Общ) Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатурныеГруппы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Автомобили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасходТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бак</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Топливо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/ОбщийМодульДляПодписокНаСобытия/Ext/Module.bsl
Процедура ОбработкаПроведенияПоступлениеТоваровУслугОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	// Установка цен
	ЗапросУстановкиЦен = Новый Запрос;
	ЗапросУстановкиЦен.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатуры.Ссылка КАК УстановкаЦен
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.ДокументОснование = &ДокументОснование
	|	И УстановкаЦенНоменклатуры.Проведен";
	ЗапросУстановкиЦен.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	РезультатЗапроса = ЗапросУстановкиЦен.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДокументУстановкиЦен = Выборка.УстановкаЦен.ПолучитьОбъект();
	Иначе
		ДокументУстановкиЦен = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	КонецЕсли;	
	
	ДокументУстановкиЦен.Дата 				= Источник.Дата;
	ДокументУстановкиЦен.ДокументОснование 	= Источник.Ссылка;
	ДокументУстановкиЦен.Комментарий 		= "Документ создан на основании " + Источник;
	ДокументУстановкиЦен.ТипыЦен.Очистить();
	НовыйТипЦен 							= ДокументУстановкиЦен.ТипыЦен.Добавить();
	НовыйТипЦен.ТипЦен 						= Справочники.ТипыЦенНоменклатуры.ЦенаЗакупкиВес;
	НовыйТипЦен 							= ДокументУстановкиЦен.ТипыЦен.Добавить();
	НовыйТипЦен.ТипЦен 						= Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес;
	ДокументУстановкиЦен.Товары.Очистить();
	
	ТабТовары = Источник.Товары.Выгрузить();
	ТабТовары.Свернуть("Номенклатура, ЦенаЗакупкиВес, ЦенаПродажиВес");
	ЗапросТовара = Новый Запрос;
	ЗапросТовара.Текст = 
	 "ВЫБРАТЬ
	 |	ВТТовары.Номенклатура,
	 |	ВТТовары.ЦенаЗакупкиВес,
	 |	ВТТовары.ЦенаПродажиВес
	 |ПОМЕСТИТЬ ВТТовары
	 |ИЗ
	 |	&ВТТовары КАК ВТТовары
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТТовары.Номенклатура,
	 |	ЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения,
	 |	ВТТовары.ЦенаЗакупкиВес,
	 |	ВТТовары.ЦенаПродажиВес
	 |ИЗ
	 |	ВТТовары КАК ВТТовары
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	 |		ПО ВТТовары.Номенклатура = ЕдиницыИзмерения.Владелец
	 |ГДЕ
	 |	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код = ВЫБОР
	 |			КОГДА ЕдиницыИзмерения.Владелец.ВідображатиВШтуках = ИСТИНА
	 |				ТОГДА ""2009""
	 |			ИНАЧЕ ""0301""
	 |		КОНЕЦ";
	ЗапросТовара.УстановитьПараметр("ВТТовары", ТабТовары);
	РезультатЗапроса = ЗапросТовара.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗТовары = РезультатЗапроса.Выгрузить();
		Для Каждого СтрТовары Из ТЗТовары Цикл 
			Если ДокументУстановкиЦен.Товары.Найти(СтрТовары.Номенклатура,"Номенклатура") <> Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока 					= ДокументУстановкиЦен.Товары.Добавить();
			НоваяСтрока.Номенклатура 		= СтрТовары.Номенклатура;
			НоваяСтрока.ТипЦен 		 		= Справочники.ТипыЦенНоменклатуры.ЦенаЗакупкиВес;
			НоваяСтрока.Цена 				= СтрТовары.ЦенаЗакупкиВес;
			НоваяСтрока.СпособРасчетаЦены	= НоваяСтрока.ТипЦен.СпособРасчетаЦены;
			НоваяСтрока.ЕдиницаИзмерения	= СтрТовары.ЕдиницаИзмерения;
			НоваяСтрока.Валюта				= НоваяСтрока.ТипЦен.ВалютаЦены;
			
			НоваяСтрока 					= ДокументУстановкиЦен.Товары.Добавить();
			НоваяСтрока.Номенклатура 		= СтрТовары.Номенклатура;
			НоваяСтрока.ТипЦен 		 		= Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес;
			НоваяСтрока.Цена 				= СтрТовары.ЦенаПродажиВес;
			НоваяСтрока.СпособРасчетаЦены	= НоваяСтрока.ТипЦен.СпособРасчетаЦены;
			НоваяСтрока.ЕдиницаИзмерения	= СтрТовары.ЕдиницаИзмерения;
			НоваяСтрока.Валюта				= НоваяСтрока.ТипЦен.ВалютаЦены;			
		КонецЦикла;			
	КонецЕсли;	
	
	Попытка
		ДокументУстановкиЦен.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		
		ДокументУстановкиЦен.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	// -
	
	// Анализ на предмет полноты поступления
	#Если Клиент Тогда
	Если Источник.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
		И ТипЗнч(Источник.Сделка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
		Если Источник.Сделка <> Документы.ЗаказПоставщику.ПустаяСсылка() Тогда 
			ТекущийЗаказ 	= Источник.Сделка.ПолучитьОбъект();
			ТЗЗаказано 		= ТекущийЗаказ.Товары.Выгрузить();
			ТЗЗаказано.Свернуть("Номенклатура", "Количество, Сумма, СуммаНДС");
			ТЗПоступило   = Источник.Товары.Выгрузить();
			ТЗПоступило.Свернуть("Номенклатура", "Количество, Сумма, СуммаНДС");
			МассивДозаказать = Новый Массив;
			Для Каждого СтрЗаказано Из ТЗЗаказано Цикл 
				СтрПоступило = ТЗПоступило.Найти(СтрЗаказано.Номенклатура, "Номенклатура");
				Если СтрПоступило = Неопределено Тогда 
					МассивДозаказать.Добавить(СтрЗаказано);
				Иначе 
					Дозаказать = СтрЗаказано.Количество - СтрПоступило.Количество;
					Если Дозаказать > 0 Тогда 
						СтрЗаказано.Количество = Дозаказать;
						МассивДозаказать.Добавить(СтрЗаказано);
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			Если МассивДозаказать.Количество() > 0 Тогда 
				Ответ = Вопрос("Не весь товар поступил. Дозаказать?", РежимДиалогаВопрос.ДаНет);
				Если Ответ = КодВозвратаДиалога.Да Тогда 
					НовыйЗаказ = Документы.ЗаказПоставщику.НайтиПоРеквизиту("ДокументОснование", ТекущийЗаказ.Ссылка);
					Если НовыйЗаказ = Документы.ЗаказПоставщику.ПустаяСсылка() Тогда 
						НовыйЗаказПоставщику 					= Документы.ЗаказПоставщику.СоздатьДокумент();
						ЗаполнитьЗначенияСвойств(НовыйЗаказПоставщику, ТекущийЗаказ);
						НовыйЗаказПоставщику.Дата 				= ТекущаяДата();
						НовыйЗаказПоставщику.ДокументОснование 	= ТекущийЗаказ.Ссылка;
					Иначе 
						НовыйЗаказПоставщику = НовыйЗаказ.ПолучитьОбъект();
						НовыйЗаказПоставщику.ПометкаУдаления = Ложь;
						НовыйЗаказПоставщику.Товары.Очистить();
					КонецЕсли;
					Для Каждого ЭлМассива Из МассивДозаказать Цикл 
						ТекСтрока = ТекущийЗаказ.Товары.Найти(ЭлМассива.Номенклатура, "Номенклатура");
						Если ТекСтрока <> Неопределено Тогда 
							НоваяСтрока = НовыйЗаказПоставщику.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
							НоваяСтрока.Количество = ЭлМассива.Количество;
						КонецЕсли;	
					КонецЦикла;
					Попытка
						НовыйЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						НовыйЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
				Иначе 
					НовыйЗаказ = Документы.ЗаказПоставщику.НайтиПоРеквизиту("ДокументОснование", ТекущийЗаказ.Ссылка);	
					Если НовыйЗаказ <> Документы.ЗаказПоставщику.ПустаяСсылка() Тогда 
						НовыйЗаказПоставщику = НовыйЗаказ.ПолучитьОбъект();
						НовыйЗаказПоставщику.ПометкаУдаления = Истина;
						НовыйЗаказПоставщику.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ДокументМаршрутныйЛистПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;	
	
	Если НЕ Источник.Проведен Тогда 
		Возврат;
	КонецЕсли;	
	
	Если НЕ (Источник.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Источник.Архивный Тогда 
		Возврат;
	КонецЕсли;
	
	
	// Создание реализаций и закрытия заказов 
    ВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();
	ЗаказыИсточника = Источник.Продажи.Выгрузить();
	ЗаказыИсточника.Свернуть("ЗаказПокупателя, Контрагент");
	Для Каждого СтрЗаказ Из ЗаказыИсточника Цикл 
		СуммаСкидкиНаценки = 0;
		Для Каждого СтрРасчет Из Источник.Расчеты Цикл 
			Если СтрРасчет.Контрагент = СтрЗаказ.Контрагент 
				И СтрРасчет.ЗаказПокупателя = СтрЗаказ.ЗаказПокупателя Тогда
					СуммаСкидкиНаценки = СуммаСкидкиНаценки + СтрРасчет.СуммаСкидкиНаценки;
			КонецЕсли;		
		КонецЦикла;	
		КурсРасчетов 		= Источник.ПолучитьКурсВалютыРасчета(СтрЗаказ.Контрагент, ВалютаУпрУчета);
		КурсДокумента 		= КурсРасчетов.КурсУпр;		
		НеплановаяПродажа 	= (СтрЗаказ.ЗаказПокупателя.ДоговорКонтрагента = СтрЗаказ.Контрагент.ДоговорДляНеплановыхПродаж);
		СоздатьРеализацию(СтрЗаказ.ЗаказПокупателя, СтрЗаказ.Контрагент, Источник.Продажи, Источник.Ссылка, КурсДокумента, СуммаСкидкиНаценки, НеплановаяПродажа);
		//Если НЕ (СтрЗаказ.ЗаказПокупателя.ДоговорКонтрагента = СтрЗаказ.Контрагент.ДоговорДляНеплановыхПродаж) Тогда 
		//	СоздатьЗакрытиеЗаказа(СтрЗаказ.ЗаказПокупателя, Источник.Ссылка);	
		//КонецЕсли;	
	КонецЦикла;	
	
	// Создание кассовых ордеров (ПКО)
	//Для Каждого СтрОплата Из Источник.Оплата Цикл 
	//	Если НЕ СтрОплата.Возврат Тогда 
	//		СоздатьОплату(СтрОплата, Источник.Ссылка, Источник);
	//	Иначе 
	//		СоздатьРКО(СтрОплата, Источник.Ссылка, Источник);	
	//	КонецЕсли;	
	//КонецЦикла;		
	
	Если Источник.Автомобиль <> Справочники.Автомобили.ПустаяСсылка() Тогда 
		СоздатьСписаниеТоваров(Источник.Автомобиль, Источник.Ссылка, Источник);	
	КонецЕсли; 	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВЫЗЫВАЕМЫЕ ПРИ СРАБАТЫВАНИИ СОБЫТИЙ 

Процедура СоздатьРеализацию(ТекущийЗаказ, ТекущийКонтрагент, ТЧТовары, ИсточникСсылка, КурсДокумента, СкидкаНаценка, Знач НеплановаяПродажа)
	
	Если Не ЗначениеЗаполнено(ТекущийЗаказ) Тогда 
		НеплановаяПродажа = Истина;
	КонецЕсли;
	
	Если ТекущийКонтрагент 	= Справочники.Контрагенты.ПустаяСсылка() Тогда 
		Возврат;
	КонецЕсли;		
	
	ЗапросРеализации = Новый Запрос;
	Если НЕ НеплановаяПродажа Тогда 
		ЗапросРеализации.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	(РеализацияТоваровУслуг.Сделка = &Сделка
		|			И РеализацияТоваровУслуг.МаршрутныйЛист = &Маршрутний)
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
		ЗапросРеализации.УстановитьПараметр("Сделка", ТекущийЗаказ);
		ЗапросРеализации.УстановитьПараметр("Маршрутний", ИсточникСсылка);
	Иначе 
		ЗапросРеализации.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.МаршрутныйЛист = &МаршрутныйЛист
		|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
		ЗапросРеализации.УстановитьПараметр("МаршрутныйЛист", ИсточникСсылка);		
		ЗапросРеализации.УстановитьПараметр("Контрагент", ТекущийКонтрагент);		
	КонецЕсли;
	
	РезультатЗапроса = ЗапросРеализации.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка 		   = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДокументРеализации = Выборка.Ссылка.ПолучитьОбъект();
	Иначе 	
		ДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();	
	КонецЕсли;	
	ДокументРеализации.Дата 						= Мин(ИсточникСсылка.ДатаПриезда + 1, ТекущаяДата());
	мВалютаУправленческогоУчета 					= Константы.ВалютаУправленческогоУчета.Получить();
	мВалютаРегламентированногоУчета 				= Константы.ВалютаРегламентированногоУчета.Получить();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументРеализации, глЗначениеПеременной("глТекущийПользователь"), мВалютаУправленческогоУчета, "Продажа");
	//ДокументРеализации.ВалютаДокумента			= мВалютаУправленческогоУчета;
	Если Не ЗначениеЗаполнено(ДокументРеализации.КурсВзаиморасчетов) Тогда 
		ДокументРеализации.КурсВзаиморасчетов			= КурсДокумента;
		ДокументРеализации.КратностьВзаиморасчетов = 1;
	КонецЕсли;
	
	ДокументРеализации.ОтражатьВУправленческомУчете = ИсточникСсылка.ОтражатьВУправленческомУчете;
	ДокументРеализации.ОтражатьВБухгалтерскомУчете 	= ИсточникСсылка.ОтражатьВБухгалтерскомУчете;
	ДокументРеализации.ОтражатьВНалоговомУчете 		= ИсточникСсылка.ОтражатьВНалоговомУчете;
	ДокументРеализации.Контрагент 					= ТекущийКонтрагент;
	ДокументРеализации.ДоговорКонтрагента 			= ?(НеплановаяПродажа, ТекущийКонтрагент.ДоговорДляНеплановыхПродаж, ТекущийЗаказ.ДоговорКонтрагента);
	ДокументРеализации.Комментарий 					= "Створено при закритті документа " + ИсточникСсылка;
	ДокументРеализации.Сделка 						= ТекущийЗаказ;
	ДокументРеализации.Организация 					= ИсточникСсылка.Организация;
	ДокументРеализации.Склад 						= ?(НеплановаяПродажа, ИсточникСсылка.Склад, ТекущийЗаказ.СкладГруппа);
	ДокументРеализации.МаршрутныйЛист 				= ИсточникСсылка;
	ДокументРеализации.Товары.Очистить();
	Для Каждого ТекСтрока Из ТЧТовары Цикл
		Если (ТекСтрока.ЗаказПокупателя = ТекущийЗаказ) И (ТекСтрока.Контрагент = ТекущийКонтрагент) Тогда
			Если ТекСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;			
			Если ТекСтрока.Возврат Тогда
				Продолжить;
			КонецЕсли;						
			СтрокаТабличнойЧасти 								= ДокументРеализации.Товары.Добавить();
			СтрокаТабличнойЧасти.Номенклатура 					= ТекСтрока.Номенклатура;
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры 	= ТекСтрока.ХарактеристикаНоменклатуры;
			СтрокаТабличнойЧасти.Количество     				= ТекСтрока.Количество;
			ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтрокаТабличнойЧасти, ДокументРеализации);
			СтрокаТабличнойЧасти.ЕдиницаИзмерения 				= СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
			СтрокаТабличнойЧасти.Коэффициент      				= 1;
			СтрокаТабличнойЧасти.Цена 							= ТекСтрока.Цена;
			СтрокаТабличнойЧасти.ЦенаПродажиВес					= ТекСтрока.ЦенаПродажиВес;
			СтрокаТабличнойЧасти.Склад 							= ДокументРеализации.Склад;
			СтрокаТабличнойЧасти.СпособСписанияОстаткаТоваров 	= Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва;
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументРеализации);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументРеализации);
		КонецЕсли;		
	КонецЦикла;	
	Если СкидкаНаценка <> 0 Тогда 
		МаксСтрока  = Неопределено;
		МаксСумма 	= 0;
		Для Каждого СтрТовар Из ДокументРеализации.Товары Цикл 
			Если СтрТовар.Сумма > МаксСумма Тогда 
				МаксСумма 	= СтрТовар.Сумма;
				МаксСтрока 	= СтрТовар;
			КонецЕсли;	
		КонецЦикла;	
		Если МаксСтрока <> Неопределено Тогда 
			МаксСтрока.Сумма = МаксСтрока.Сумма + СкидкаНаценка;
			МаксСтрока.Цена	 = ?(МаксСтрока.Количество = 0, 0, МаксСтрока.Сумма/МаксСтрока.Количество);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(МаксСтрока, ДокументРеализации);
		КонецЕсли;	
	КонецЕсли;
	
	//Для Каждого СтрТов Из ДокументРеализации.Товары Цикл
	//КонецЦикла;
	
	
	Попытка
		ДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	    #Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#Иначе
			ЗаписьЖурналаРегистрации("ОШИБКА ЗАПИСИ РЕАЛИЗАЦИИ", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		#КонецЕсли

		ДокументРеализации.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;	
	
КонецПроцедуры	

Процедура СоздатьЗакрытиеЗаказа(ТекущийЗаказ, ИсточникСсылка)
	
	ЗапросЗакрытия = Новый Запрос;
	ЗапросЗакрытия.Текст = 
	"ВЫБРАТЬ
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеЗаказовПокупателей.Заказы КАК ЗакрытиеЗаказовПокупателейЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка.МаршрутныйЛист = &МаршрутныйЛист
	|	И ЗакрытиеЗаказовПокупателейЗаказы.ЗаказПокупателя = &ЗаказПокупателя";
	ЗапросЗакрытия.УстановитьПараметр("МаршрутныйЛист", ИсточникСсылка);
	ЗапросЗакрытия.УстановитьПараметр("ЗаказПокупателя", ТекущийЗаказ);
	РезультатЗапроса = ЗапросЗакрытия.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка 		   = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДокументЗакрытия = Выборка.Ссылка.ПолучитьОбъект();
	Иначе 	
		ДокументЗакрытия = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();	
	КонецЕсли;		
	ДокументЗакрытия.Заказы.Очистить();
	ДокументЗакрытия.Дата = ИсточникСсылка.ДатаПриезда + 1;
	ДокументЗакрытия.ВидОперации = Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
	ДокументЗакрытия.МаршрутныйЛист = ИсточникСсылка;
	ДокументЗакрытия.Комментарий 	= "Створено при закритті документа " + ИсточникСсылка;
	Если ТекущийЗаказ <> Документы.ЗаказПокупателя.ПустаяСсылка() Тогда 
		НоваяСтрока = ДокументЗакрытия.Заказы.Добавить();
		НоваяСтрока.ЗаказПокупателя = ТекущийЗаказ;
	КонецЕсли;
	
	Попытка
		ДокументЗакрытия.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ДокументЗакрытия.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;		
	
КонецПроцедуры	

//Процедура СоздатьОплату(ТекущаяОплата, ИсточникСсылка, ИсточникОбъект)
//	
//	Если ТекущаяОплата.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда 
//		Возврат;
//	КонецЕсли;	
//	
//	Если ТекущаяОплата.Сумма = 0 Тогда 
//		Возврат;
//	КонецЕсли;	
//	
//	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
//	Организация			= ИсточникСсылка.Организация;
//	Контрагент 			= ТекущаяОплата.Контрагент;
//	ДоговорКонтрагента 	= ?(ТекущаяОплата.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), Контрагент.ДоговорДляНеплановыхПродаж, ТекущаяОплата.ДоговорКонтрагента);
//	Сделка				= ?(ДоговорКонтрагента 	= Контрагент.ДоговорДляНеплановыхПродаж, Документы.ЗаказПокупателя.ПустаяСсылка(), ТекущаяОплата.ЗаказПокупателя);
//	
//	
//	Валюта				= ТекущаяОплата.Валюта;
//	Касса				= Справочники.Кассы.НайтиПоРеквизиту("ВалютаДенежныхСредств", Валюта);
//	
//	Если НЕ ТекущаяОплата.Безналичные Тогда 
//		ЗапросПД			= Новый Запрос;
//		ЗапросПД.Текст 		= 
//			"ВЫБРАТЬ
//			|	ПриходныйКассовыйОрдер.Ссылка
//			|ИЗ
//			|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
//			|ГДЕ
//			|	НЕ ПриходныйКассовыйОрдер.ПометкаУдаления
//			|	И ПриходныйКассовыйОрдер.МаршрутныйЛист = &МаршрутныйЛист
//			|	И ПриходныйКассовыйОрдер.Контрагент = &Контрагент
//			|	И ПриходныйКассовыйОрдер.Касса = &Касса
//			|	И ПриходныйКассовыйОрдер.ДокументОснование = &ДокументОснование";
//		ЗапросПД.УстановитьПараметр("МаршрутныйЛист", ИсточникСсылка);
//		ЗапросПД.УстановитьПараметр("ДокументОснование", Сделка);
//		ЗапросПД.УстановитьПараметр("Контрагент", Контрагент);
//		ЗапросПД.УстановитьПараметр("Касса", Касса);
//	Иначе 
//		ЗапросПД			= Новый Запрос;
//		ЗапросПД.Текст 		= 
//			"ВЫБРАТЬ
//			|	ПлатежноеПоручениеВходящее.Ссылка
//			|ИЗ
//			|	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
//			|ГДЕ
//			|	НЕ ПлатежноеПоручениеВходящее.ПометкаУдаления
//			|	И ПлатежноеПоручениеВходящее.МаршрутныйЛист = &МаршрутныйЛист
//			|	И ПлатежноеПоручениеВходящее.Контрагент = &Контрагент
//			|	И ПлатежноеПоручениеВходящее.ВалютаДокумента = &Валюта";
//		ЗапросПД.УстановитьПараметр("МаршрутныйЛист", ИсточникСсылка);
//		ЗапросПД.УстановитьПараметр("Контрагент", Контрагент);
//		ЗапросПД.УстановитьПараметр("Валюта", Валюта);		
//	КонецЕсли;
//	
//	РезультатЗапроса = ЗапросПД.Выполнить();
//	Если НЕ РезультатЗапроса.Пустой() Тогда 
//		Выборка 		   	= РезультатЗапроса.Выбрать();
//		Выборка.Следующий();
//		ДокументОплаты 		= Выборка.Ссылка.ПолучитьОбъект();
//		ДокументОплаты.РасшифровкаПлатежа.Очистить();
//	Иначе 	
//		Если НЕ ТекущаяОплата.Безналичные Тогда 
//			ДокументОплаты 		= Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
//		Иначе 
//			ДокументОплаты 		= Документы.ПлатежноеПоручениеВходящее.СоздатьДокумент();
//		КонецЕсли;	
//	КонецЕсли;		
//	КурсДокумента 										= ТекущаяОплата.КурсВал;
//	ДокументОплаты.Дата 								= ИсточникСсылка.Дата;
//	ДокументОплаты.Организация							= Организация;
//	ДокументОплаты.МаршрутныйЛист						= ИсточникСсылка;
//	ДокументОплаты.СтатьяДвиженияДенежныхСредств 		= Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;
//	Если НЕ ТекущаяОплата.Безналичные Тогда 
//		ДокументОплаты.ВидОперации 						= Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
//		ДокументОплаты.ОтражатьВУправленческомУчете 	= ИсточникСсылка.ОтражатьВУправленческомУчете;
//		ДокументОплаты.ОтраженоВОперУчете   			= ИсточникСсылка.ОтражатьВУправленческомУчете;
//		ДокументОплаты.Касса 							= Касса;
//		ДокументОплаты.ДокументОснование				= Сделка;
//	Иначе 	
//		ДокументОплаты.ВидОперации 						= Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
//		ДокументОплаты.ОтраженоВОперУчете 				= ИсточникСсылка.ОтражатьВУправленческомУчете;
//		ДокументОплаты.СчетОрганизации 					= Организация.ОсновнойБанковскийСчет;
//		ДокументОплаты.ДатаОплаты						= ИсточникСсылка.ДатаПриезда;
//	КонецЕсли;	
//	ДокументОплаты.ОтражатьВБухгалтерскомУчете 			= ИсточникСсылка.ОтражатьВБухгалтерскомУчете;
//	ДокументОплаты.Подразделение 						= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновноеПодразделение");
//	ДокументОплаты.Контрагент 							= Контрагент;
//	ДокументОплаты.ДоговорКонтрагента 					= ДоговорКонтрагента;
//	ДокументОплаты.ВалютаДокумента 						= Валюта;
//	ДокументОплаты.СуммаДокумента 						= ТекущаяОплата.Сумма;
//	ДокументОплаты.Оплачено 							= Истина;
//	СтрокаРасшифровки 									= ДокументОплаты.РасшифровкаПлатежа.Добавить();
//	СтрокаРасшифровки.Сделка			 				= Сделка;
//	СтрокаРасшифровки.ДоговорКонтрагента 				= ДоговорКонтрагента;
//	СтрокаРасшифровки.КурсВзаиморасчетов 				= КурсДокумента;
//	СтрокаРасшифровки.КратностьВзаиморасчетов			= 1;
//	СтрокаРасшифровки.СуммаПлатежа 						= ТекущаяОплата.Сумма;	
//	СтрокаРасшифровки.СуммаВзаиморасчетов				= ТекущаяОплата.Сумма;	
//	СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств 	= Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;
//	
//	Попытка
//		ДокументОплаты.Записать(РежимЗаписиДокумента.Проведение);
//	Исключение
//		ДокументОплаты.Записать(РежимЗаписиДокумента.Запись);
//	КонецПопытки;	
//	
//КонецПроцедуры	

//Процедура СоздатьРКО(ТекущаяОплата, ИсточникСсылка, ИсточникОбъект)
//	
//	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
//	Организация			= ИсточникСсылка.Организация;
//	Контрагент 			= ТекущаяОплата.Контрагент;
//	ДоговорКонтрагента 	= ТекущаяОплата.ДоговорКонтрагента;
//	Сделка				= ТекущаяОплата.ЗаказПокупателя;
//	Валюта				= ТекущаяОплата.Валюта;
//	Касса				= Справочники.Кассы.НайтиПоРеквизиту("ВалютаДенежныхСредств", Валюта);
//	
//	ЗапросПД			= Новый Запрос;
//	ЗапросПД.Текст 		= 
//		"ВЫБРАТЬ
//		|	РасходныйКассовыйОрдер.Ссылка
//		|ИЗ
//		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
//		|ГДЕ
//		|	НЕ РасходныйКассовыйОрдер.ПометкаУдаления
//		|	И РасходныйКассовыйОрдер.МаршрутныйЛист = &МаршрутныйЛист
//		|	И РасходныйКассовыйОрдер.Контрагент = &Контрагент
//		|	И РасходныйКассовыйОрдер.Касса = &Касса
//		|	И РасходныйКассовыйОрдер.ДокументОснование = &ДокументОснование";
//	ЗапросПД.УстановитьПараметр("МаршрутныйЛист", ИсточникСсылка);
//	ЗапросПД.УстановитьПараметр("ДокументОснование", ТекущаяОплата.ЗаказПокупателя);
//	ЗапросПД.УстановитьПараметр("Контрагент", Контрагент);
//	ЗапросПД.УстановитьПараметр("Касса", Касса);
//	
//	РезультатЗапроса = ЗапросПД.Выполнить();
//	Если НЕ РезультатЗапроса.Пустой() Тогда 
//		Выборка 		   	= РезультатЗапроса.Выбрать();
//		Выборка.Следующий();
//		ДокументОплаты 		= Выборка.Ссылка.ПолучитьОбъект();
//		ДокументОплаты.РасшифровкаПлатежа.Очистить();
//	Иначе 	
//		ДокументОплаты 		= Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
//	КонецЕсли;		
//	КурсДокумента 										= ТекущаяОплата.КурсВал;
//	ДокументОплаты.Дата 								= ИсточникСсылка.Дата;
//	ДокументОплаты.Организация							= Организация;
//	ДокументОплаты.МаршрутныйЛист						= ИсточникСсылка;
//	ДокументОплаты.СтатьяДвиженияДенежныхСредств 		= Справочники.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствПокупателю;
//	ДокументОплаты.ВидОперации 							= Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю;
//	ДокументОплаты.ОтражатьВУправленческомУчете 		= ИсточникСсылка.ОтражатьВУправленческомУчете;
//	ДокументОплаты.ОтраженоВОперУчете   				= ИсточникСсылка.ОтражатьВУправленческомУчете;
//	ДокументОплаты.Касса 								= Касса;
//	ДокументОплаты.ОтражатьВБухгалтерскомУчете 			= ИсточникСсылка.ОтражатьВБухгалтерскомУчете;
//	ДокументОплаты.Подразделение 						= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновноеПодразделение");
//	ДокументОплаты.Контрагент 							= Контрагент;
//	ДокументОплаты.ДоговорКонтрагента 					= ДоговорКонтрагента;
//	ДокументОплаты.ДокументОснование					= ТекущаяОплата.ЗаказПокупателя;
//	ДокументОплаты.ВалютаДокумента 						= Валюта;
//	ДокументОплаты.СуммаДокумента 						= ТекущаяОплата.Сумма;
//	ДокументОплаты.Оплачено 							= Истина;
//	СтрокаРасшифровки 									= ДокументОплаты.РасшифровкаПлатежа.Добавить();
//	СтрокаРасшифровки.Сделка			 				= Сделка;
//	СтрокаРасшифровки.ДоговорКонтрагента 				= ДоговорКонтрагента;
//	СтрокаРасшифровки.КурсВзаиморасчетов 				= КурсДокумента;
//	СтрокаРасшифровки.КратностьВзаиморасчетов			= 1;
//	СтрокаРасшифровки.СуммаПлатежа 						= ТекущаяОплата.Сумма;	
//	СтрокаРасшифровки.СуммаВзаиморасчетов				= ТекущаяОплата.Сумма;	
//	СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств 	= Справочники.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствПокупателю;
//	
//	Попытка
//		ДокументОплаты.Записать(РежимЗаписиДокумента.Проведение);
//	Исключение
//		ДокументОплаты.Записать(РежимЗаписиДокумента.Запись);
//	КонецПопытки;	
//	
//КонецПроцедуры	

Процедура СоздатьСписаниеТоваров(Автомобиль, ИсточникСсылка, ИсточникОбъект)
	
	ЗапросСписания = Новый Запрос;
	ЗапросСписания.Текст = 
		"ВЫБРАТЬ
		|	СписаниеТоваров.Ссылка
		|ИЗ
		|	Документ.СписаниеТоваров КАК СписаниеТоваров
		|ГДЕ
		|	СписаниеТоваров.МаршрутныйЛист = &МаршрутныйЛист
		|	И НЕ СписаниеТоваров.ПометкаУдаления";
	ЗапросСписания.УстановитьПараметр("МаршрутныйЛист", ИсточникСсылка);
	
	РезультатЗапроса = ЗапросСписания.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка 		   = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДокументСписания = Выборка.Ссылка.ПолучитьОбъект();
	Иначе 	
		ДокументСписания = Документы.СписаниеТоваров.СоздатьДокумент();	
	КонецЕсли;	
	ДокументСписания.Дата 			= Мин(ИсточникСсылка.ДатаПриезда, ТекущаяДата());
	мВалютаУправленческогоУчета 	= Константы.ВалютаУправленческогоУчета.Получить();
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументСписания, глЗначениеПеременной("глТекущийПользователь"), мВалютаУправленческогоУчета);	
	ДокументСписания.ОтражатьВУправленческомУчете = Истина;	
	ДокументСписания.МаршрутныйЛист	= ИсточникСсылка;
	ДокументСписания.Склад 			= Автомобиль.Бак;
	ДокументСписания.Товары.Очистить();
	НоваяСтрока 					= ДокументСписания.Товары.Добавить();
	НоваяСтрока.Номенклатура 		= Автомобиль.Топливо;
	НормаРасхода 					= Автомобиль.РасходТоплива;
	НоваяСтрока.ЕдиницаИзмерения 	= Автомобиль.Топливо.ЕдиницаХраненияОстатков;
	НоваяСтрока.Качество 			= Справочники.Качество.Новый; 
	НоваяСтрока.Количество 			= ИсточникОбъект.Пробег/100 * НормаРасхода;
	НоваяСтрока.Коэффициент 		= НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
	
	Попытка
		ДокументСписания.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	    #Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#Иначе
			ЗаписьЖурналаРегистрации("ОШИБКА ЗАПИСИ СПИСАНИЯ", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		#КонецЕсли

		ДокументСписания.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;		
	
КонецПроцедуры
